[
    {
      "id": 1,
      "name": "What is C?",
      "message": "C एक general purpose programming language है जिसे softwares, OS, Kernels, JVMs आदि बनाने के लिए use किया जाता है। इसे सन् 1970 में Dennis Ritchie द्वारा develop किया गया था । जिसे middle-level language भी कहा जाता है क्यूंकि यह low-level और high-level दोनो के features को support करता है।\n\nचलिए इसे एक example से समझते है जैसे किसी C language में लिखे प्रोग्राम को हम assembly code में बदल सकते है जो pointer arithmetic structure support करता है यह feature low-level language में देखा जाता है। और C language एक machine independent होता है ये feature high-level language में होता है।\n\nC programming language बहुत पुरानी programming language है जिसे system software बनाने के लिए develope किया गया था भले ही आज और अन्य languages market में available हैं लेकिन C हमेशा से ही एक famous programming language रही है।\n\nक्यूंकि C language को किसी अन्य language के साथ बदला नहीं जा सकता ऐसा इसलिए क्योंकि C कई सारी languages का base है। क्यूंकि mostly programming languages C language के syntax follow करती है , जैसे python, C++, Java, C# etc. और C language को mother language भी कहते है क्यूंकि बहुत से JVMs, Compliers, Kernels etc को C language में लिखा गया हैं और इसी के कारण C language को core language से भी जानते हैं।\n\nऔर C language को कई तरह के programming language के रूप use किया जाता है जैसे -\n\n1. Middle-level programming\n\n2. System programming\n\n3. Procedure-oriented programming\n\n4. Structured programming\n\nऔर भी अन्य प्रकार से इस programming language का use किया जाता है।"
    },
    {
        "id": 2,
        "name": "How To Install C",
        "message": "C को install करना बेहद आसान है इसके लिए हमे सबसे पहले एक Compiler को download करना होगा market में बहुत सारे compilers available है हमे इसमें से कोई एक download करना है हम यहाँ Turbo C++ को install करने की सलाह देंगे क्योंकि यह बहुत पुराना और popular है। और यह C और C++ दोनो को support करता है। Turbo C++ को install करने के लिए दिए गए instructions को follow करें।\n\n1. किसी भी website से Turbo C++ को download करें।\n\n2.अब आपको C drive के अंदर एक नई directory Turboc बनाने की जरूरत है और अब tc3.zip file को c:\turboc directory में extract कर दें। \n\n3.अब, c:\turboc के अंदर install का icon दिखेगा जिसपे आप क्लिक करें। \n\n4. यहाँ आपको c install करने के लिए कहेगा install करने के लिए enter बटन दबाएं।\n\n5. अब अपनी drive को c में बदलने के लिए c दबाएं।\n\n6. फिर एक window दिखेगी यहाँ enter दबाएं, यह जरूरी files के लिए c:\turboc directory के अंदर दिखेगा।\n\n7. down Arrow के द्वारा Start Installation चुनें और फिर enter दबाएं।\n\n8. अब turbo C++ install हो गया है, Readme file को पढ़ने या Software को बंद करने के लिए enter दबाएं।\n\n9. अब c program लिखने के लिए c:\\TC\\BIN directory में tc icon पर double click करें।\n\nयह application win 7 और win 8 में एक ignore या Close का dialog box दिखायेगा क्योंकि यह इन windows में Full screen support नही करता है तो आप ignore button पे click करें। उसके बाद आपको main writing console screen दिखेगी जहाँ आप अपने program लिख सकते हैं।"
    },
    {
        "id": 3,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    },
    {
        "id": 4,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    },
    {
        "id": 5,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    },
    {
        "id": 6,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    }
]
