[
    {
      "id": 1,
      "name": "What is C?",
      "message": "C एक general purpose programming language है जिसे softwares, OS, Kernels, JVMs आदि बनाने के लिए use किया जाता है। इसे सन् 1970 में Dennis Ritchie द्वारा develop किया गया था । जिसे middle-level language भी कहा जाता है क्यूंकि यह low-level और high-level दोनो के features को support करता है।\n\nचलिए इसे एक example से समझते है जैसे किसी C language में लिखे प्रोग्राम को हम assembly code में बदल सकते है जो pointer arithmetic structure support करता है यह feature low-level language में देखा जाता है। और C language एक machine independent होता है ये feature high-level language में होता है।\n\nC programming language बहुत पुरानी programming language है जिसे system software बनाने के लिए develope किया गया था भले ही आज और अन्य languages market में available हैं लेकिन C हमेशा से ही एक famous programming language रही है।\n\nक्यूंकि C language को किसी अन्य language के साथ बदला नहीं जा सकता ऐसा इसलिए क्योंकि C कई सारी languages का base है। क्यूंकि mostly programming languages C language के syntax follow करती है , जैसे python, C++, Java, C# etc. और C language को mother language भी कहते है क्यूंकि बहुत से JVMs, Compliers, Kernels etc को C language में लिखा गया हैं और इसी के कारण C language को core language से भी जानते हैं।\n\nऔर C language को कई तरह के programming language के रूप use किया जाता है जैसे -\n\n1. Middle-level programming\n\n2. System programming\n\n3. Procedure-oriented programming\n\n4. Structured programming\n\nऔर भी अन्य प्रकार से इस programming language का use किया जाता है।"
    },
    {
        "id": 2,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    },
    {
        "id": 3,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    },
    {
        "id": 4,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    },
    {
        "id": 5,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    },
    {
        "id": 6,
        "name": "Abhivishrut Vishnoi",
        "message": "Hello! This is Abhivishrut Bishnoi. I am a Founder & ECO, Codewati"
    }
]
