[
    {
        "id": "01",
        "name": "Introduction",
        "message": "游린 Java ek general-purpose computer programming language hai. Iska developer Sun Microsystems tha, jinhein 2010 mein Oracle Corporation ne acquire kiya tha. Is language ko 1995 mein launch kiya gaya tha.\n\n游린 Java ek object-oriented programming language hai, jismein hum objects aur classes ka use karte hain. Ismein, humein ek codebase ko har platform par chalane ke liye compile karne ki zaroorat nahi hai. Isliye, Java ko \"write once, run anywhere\" approach ke naam se jaana jata hai.\n\n游린 Ismein, humein Java Virtual Machine (JVM) ke through program execute karna padta hai. JVM har platform par chalta hai, isliye Java ke code ko har jagah chalane ke liye compile karne ki zaroorat nahi hai.",
        "example":"0",
        "remcont":"游린 Java ke paar, humein web-based applications, mobile applications, desktop applications, enterprise applications, etc. banaane ke liye use kar sakte hain. Ismein, humein exception handling bhi kar sakte hain, jisse aap program ke dair-dair errors ko handle kar sakte hain.\n\n游린 Iske alawa, Java ek robust aur secure language hai, isliye iska use financial, healthcare, education, etc. industries mein bahut mahatvapurn hai. Ismein bahut se libraries aur frameworks bhi available hain, jisse hum aapke requirements ke anuroop applications bana sakte hain.\n\n游린 Java ke paar pichhle saalon mein bahut se updates aur version aaye hain, jaise ki Java 9, Java 10, Java 11, etc. Iske saath, bahut se new features aur improvements bhi aaye hain. Isliye, agar aap Java sikhna chahte hain, to aap iske naye versions ko bhi sikhna chahiye.\n\n"
    },
    {
        "id": "02",
        "name": "Installation",
        "message": "游린 Java ko install karne ke liye, aap Java Development Kit (JDK) ko apne computer par install karna chaahate hain. JDK ko Oracle website se download kar sakte hain.",
        "example":"0",
        "remcont":"游늷~1: Oracle website pe jaakar, \"Download JDK\" ko click karo.\n\n游늷~2: Apne computer ki operating system ke anuroop JDK ko download karo.\n\n游늷~3: JDK installer ko chalo aur installation process ko follow karo.\n\n游늷~4: Installation process mein, aapko ek screen milega jismein aapko \"Install\" button dikhaai dega. Is button ko click karo aur installation process shuru ho jaayegi.\n\n游늷~5: Installation process ke baad, aapka computer mein Java install ho jaayega.\n\n游늷~6: Installation ke baad, aapke system ke PATH variable ko update karna chaahiye hai. PATH variable ko update karne ke liye, aapko system settings ke settings mein jaana hoga.\n\n游늷~7: Settings mein, \"Environment Variables\" ko click karo aur \"Path\" ko select karo.\n\n游늷~8: \"Path\" ko edit karne ke liye, \"Edit\" button ko click karo aur ek neeche wala empty field mein, aapko Java bin directory ko paste karna hoga. Java bin directory ko paste karne ke baad, \"OK\" button ko click karo.\n\n游늷~9: Isse, aapka computer ready hoga Java ke applications ko run karne ke liye.\n\n"
    },
    {
        "id": "03",
        "name": "Java Syntax",
        "message": "游린 Ek Java program shuru ho jaata hai ek class ke saath.\nclass ke andar, hum apne program ka main method define karte hain, jismein humein program ka entry point bataya jata hai.",
        "example": "class HelloJava {\n    public static void main(String[] args) {\n        System.out.println(\"Hello, Welcome to Codewati Tech Private Limited:)\");\n    }\n}",
        "remcont": "游린 Iska matlab yeh hai ki hum Java mein, objects aur functions ka use karte hain. \"System\" ek object hai jise hum use karte hain Java runtime ke liye. \"out\" ek variable hai jiska matlab yeh hai ki output stream. Aur \"println\" ek function hai jismein hum string ko print karwate hain aur ek endline character bhi add karte hain.\n\n"
    },
    {
        "id": "04",
        "name": "Comments",
        "message": "游린 Java mein, hum code ke liye comments bhi likh sakte hain. Comments code ko user ke liye explain karte hain aur code ko neat aur clean banate hain.\n\n游린 Hum Java mein, do types ke comments likh sakte hain:\n\n游늷~1. Single line comments:\nSingle line comments ek line mein comments ka kaam karte hain. Iske liye, hum // ka use karte hain.\n\n游늷~2. Multi-line comments:\nMulti-line comments mein, hum bahut saare lines comments kar sakte hain. Iske liye, hum /* aur */ ka use karte hain.",
        "example": "public class HelloWorld {\n    // This is a single line comment\n    public static void main(String[] args) {\n        /*\n         * This is a\n         * multi-line comment\n         */\n        System.out.println(\"Hello, World!\");\n    }\n}",
        "remcont": "0"
    },
    {
        "id": "05",
        "name": "Variables",
        "message": "游린 Java mein, hum data ko store karna chahte samay, hum variables ka use karte hain. Variable ek memory location hai jismein hum data ko store kar sakte hain.\n\n游린 Hum variables ke saath data ko access kar sakte hain aur change kar sakte hain. Har variable ek data type hoga jaise ki int, float, char, boolean, string, etc.\n\n",
        "example": "int age;\nage = 25;\nString name = \"John Doe\";",
        "remcont": "游린 In this example, we have defined two variables:\n\n游늷~1. 'age': Ek integer variable hai jismein hum age ka data store kar sakte hain.\n游늷~2. 'name': Ek string variable hai jismein hum name ka data store kar sakte hain.\n\n游린 Hum, variables ko initialize karte samay, hum unhe ek value assign karte hain. Is value, variables ke data type ke anuroop hota hai.\n\n游린 Hum, variables ko bahut saare modifiers se define kar sakte hain, jaise ki access modifiers, non-access modifiers, etc.\n\n"
    },
    {
        "id": "06",
        "name": "Final Variables",
        "message": "游린 Java mein, hum variables ko final keyword se constant banate hain. Final variables ke through, hum ek value ko ek baar assign kar sakte hain, aur phir usse bad value nahi set kar sakte. Isliye, final variables ke through, hum immutable objects bana sakte hain.\n",
        "example": "public final int MAX_COUNT = 100;",
        "remcont": "游린 Is example mein, humne ek final variable MAX_COUNT define kiya hai aur usmein humne value 100 assign kiya hai. Ab hum is variable ko bad value nahi set kar sakte."
    },
    {
        "id": "07",
        "name": "Data Types",
        "message": "游린 Java mein, hum data ko store karne ke liye variables ka use karte hain. Is variables mein, hum data ko ek data type ke roop mein store karte hain. Java mein, humein do types ke data types ke bare mein jaana hai:\n\n游늷 1.~Primitive Data Types: \n\n游늸~int: Ek 32-bit signed integer hai, jo -2^31 taiyari se 2^31-1 tak values store kar sakti hai.\n\n游늸~float: Ek 32-bit IEEE 754 single-precision floating-point number hai.\n\n游늸~double: Ek 64-bit IEEE 754 double-precision floating-point number hai.\n\n游늸~boolean: Ek boolean value hai, jo true ya false ho sakta hai.\n\n游늸~char: Ek Unicode character ko store karta hai.\n\n游늸~byte: Ek 8-bit signed integer hai, jo -128 taiyari se 127 tak values store kar sakta hai.\n\n游늸~short: Ek 16-bit signed integer hai, jo -32768 taiyari se 32767 tak values store kar sakta hai.\n\n游늸~long: Ek 64-bit signed integer hai, jo -263 taiyari se 263-1 tak values store kar sakta hai.\n\n游늷 2.~Reference Data Types: \n\n游늸~Classes: Hum objects ko create karta hai.\n\n游늸~Interfaces: Hum objects ke behavior ko define karta hai.\n\n游늸~Arrays: Hum homogeneous values ko ek jagah mein store karta hai.\n\n游늸~Strings: Hum characters ka sequence store karta hai.\n",
        "example": "// int variable\nint myAge = 25;\nSystem.out.println(\"Meri Age: \" + myAge);\n\n//float variable\nfloat pi = 3.14f;\nSystem.out.println(\"Pi ki value: \" + pi);\n\n//boolean variable\nboolean isHungry = true;\nSystem.out.println(\"Mujhe bhook lag rahi hai?: \" + isHungry);\n\n//String variable\nString myName = \"Abhivishrut Bishnoi\";\nSystem.out.println(\"Mera Naam: \" + myName);\n\n//char variable\nchar myLetter = 'A';\nSystem.out.println(\"Mera alphabet: \" + myLetter);",
        "remcont": "游늷~In Example int: humne ek int variable myAge banaya hai aur usmein humne value 25 assign kiya hai. Aur humne System.out.println() ka use karke hum myAge ki value ko console mein print karwai hai.\n\n游늷~In Example float: humne ek float variable pi banaya hai aur usmein humne value 3.14 assign kiya hai. Aur humne System.out.println() ka use karke hum pi ki value ko console mein print karwai hai.\n\n游늷~In Example boolean: humne ek boolean variable isHungry banaya hai aur usmein humne value true assign kiya hai. Aur humne System.out.println() ka use karke hum isHungry ki value ko console mein print karwai hai.\n\n游늷~In Example char: humne ek char variable myLetter banaya hai aur usmein humne value 'A' assign kiya hai. Aur humne System.out.println() ka use karke hum myLetter ki value ko console mein print karwai hai.\n\n"
    },
    {
        "id": "08",
        "name": "Operators",
        "message": "游린 Java mein operators ek very important part hai. Operators help to perform arithmetic, relational, logical, and other operations on variables and values.\n\n游린 Hum Java mein, do types ke operators ka use karte hain:\n游늷~1. Unary Operators: Ek operator hai jise sirf ek operand ke saath use kiya jata hai.\n游늷~2. Binary Operators: Ek operator hai jise do operands ke saath use kiya jata hai.\n\n游린 Java mein, humein do types ke unary operators ka use karne mein familiar ho jaana chahiye:\n\n游늷~1. Pre-Increment Operator: '++'\nYahan, humein pre-increment operator ka use karke, hum ek variable ko increase karwate hain. Iske liye, hum ++ operator ko variable ka aage rakhte hain.\n\n游늷~2. Pre-Decrement Operator: '--'\nYahan, humein pre-decrement operator ka use karke, hum ek variable ko decrease karwate hain. Iske liye, hum -- operator ko variable ka aage rakhte hain.",
        "example": "public class OperatorsDemo {\n    public static void main(String[] args) {\n        // Pre-Increment Operator\n        int a = 5;\n        System.out.println(\"Original value of a: \" + a);\n        ++a;\n        System.out.println(\"After pre-increment, a is now: \" + a);\n\n        // Pre-Decrement Operator\n        int b = 10;\n        System.out.println(\"Original value of b: \" + b);\n        --b;\n        System.out.println(\"After pre-decrement, b is now: \" + b);\n\n        // Addition Operator\n        int num1 = 5;\n        int num2 = 10;\n        int sum = num1 + num2;\n        System.out.println(\"Sum of \" + num1 + \" and \" + num2 + \" is: \" + sum);\n\n        // Subtraction Operator\n        int x = 15;\n        int y = 10;\n        int difference = x - y;\n        System.out.println(\"Difference of \" + x + \" and \" + y + \" is: \" + difference);\n\n        // Multiplication Operator\n        int p = 4;\n        int q = 5;\n        int product = p * q;\n        System.out.println(\"Product of \" + p + \" and \" + q + \" is: \" + product);\n\n        // Division Operator\n        int dividend = 20;\n        int divisor = 4;\n        int quotient = dividend / divisor;\n        System.out.println(\"Quotient of \" + dividend + \" divided by \" + divisor + \" is: \" + quotient);\n\n        // Modulus Operator\n        int dividendMod = 20;\n        int divisorMod = 3;\n        int remainder = dividendMod % divisorMod;\n        System.out.println(\"Remainder of \" + dividendMod + \" divided by \" + divisorMod + \" is: \" + remainder);\n\n        // Post-Increment Operator\n        int num = 5;\n        int incrementedNum = num++;\n        System.out.println(\"Original value of num: \" + num);\n        System.out.println(\"Value of incrementedNum: \" + incrementedNum);\n\n        // Post-Decrement Operator\n        int numDec = 10;\n        int decrementedNum = numDec--;\n        System.out.println(\"Original value of numDec: \" + numDec);\n        System.out.println(\"Value of decrementedNum: \" + decrementedNum);\n    }\n}",
        "remcont": "游린 Hum Java mein, bahut saare operators ka use kar sakte hain, jaise ki multiplication operator (*), division operator (/), modulus operator (%), etc.\n\n游린 Hum Java mein, bahut saare logical operators ka use kar sakte hain, jaise ki AND operator (&&), OR operator (||), NOT operator (!), etc.\n\n游린 Hum Java mein, bahut saare relational operators ka use kar sakte hain, jaise ki equal to operator (==), not equal to operator (!=), less than operator (<), etc.\n\n游린 Hum Java mein, assignment operators ka use bhi kar sakte hain, jaise ki =, +=, -=, *=, /=, %=, etc.\n\n游린 Iske alawa, hum Java mein, increment (++), decrement (--), bitwise (&, |, , ~, <<, >>, >>>), shift (<<<, >>>), conditional (? :), and ternary (?:) operators ka use bhi kar sakte hain.\n\n游린 Iske liye, operators ek very important part of Java programming hai. Operators help to perform arithmetic, relational, logical, and other operations on variables and values.\n\n"
    },
    {
        "id": "09",
        "name": "Type Casting",
        "message": "游린 Java mein Type Casting, ek critical concept hai jise data type ko doosre data type me convert karna allowed karta hai. Iske kaam aata hai jab hum doosre data types ke operations perform karna chahte hai ya agar aap ek value ko doosre data type ke variable me store karna chahte hai.\n\nHum do types ke Type Casting ka concept dekhenge:\n\n游늷~1. Widening Type Casting: Isme, Java automaticaly ek data type ko doosre data type me convert karta hai. Jab hum ek chhota size wala data type ko, bara size wala data type me assign karenge toh is Type Casting ka use hota hai. Yeh automatically hota hai, isliye iska koi specific keyword use nahi kiya jata.\n\n游늷~2. Narrowing Type Casting: Isme, hum manual cast karte hai ek data type ko doosre data type me. Jab hum ek bara size wala data type ko, chhota size wala data type me assign karenge toh is Type Casting ka use hota hai. Isme, hum (int) keyword ka use karte hai jise hum batate hai ki hum num variable ko int type me convert karna chahte hai.\n",
        "example": "// Widening Type Casting\npublic class WideningTypeCasting {\n    public static void main(String[] args) {\n        int num = 10;\n        System.out.println(\"The integer value: \" + num);\n\n        double data = num;\n        System.out.println(\"The double value: \" + data);\n    }\n}\n\n// Narrowing Type Casting\npublic class NarrowingTypeCasting {\n    public static void main(String[] args) {\n        double num = 10.99;\n        System.out.println(\"The double value: \" + num);\n\n        int data = (int)num;\n        System.out.println(\"The integer value: \" + data);\n    }\n}",
        "remcont": "游린~Note: Narrowing Type Casting me data loss ho sakta hai, isliye hum ise explicit karne ke liye khud parenthesis me daalte hai. Humne sirf 2 types ke Type Casting ka concept diya, lekin Java mein doosre bhi types ke Type Conversion hota hai jaise string to int, int to string, etc."
    },
    {
        "id": "10",
        "name": "String",
        "message": "游린 Java mein String, ek built-in data type hai jisme hum text ko store aur manipulate kar sakte hai. String ek object hai jisme hum text ko store karte hai.\n\n游늷~1. String ek immutable object hai: String ek immutable object hai, isliye hum text ko change nahi kar sakte. Jab hum text ko change karne ke liye koshish karte hai to ek nayi String object banana padta hai.\n\n游늷~2. String ek sequence hai: String ek sequence hai jisme hum characters ko store kar sakte hai. Isliye hum string ko index ka use karke access kar sakte hai.\n\n游늷~3. String ek object hai: String ek object hai jisme hum text ko store karte hai. Isliye hum String class ke methods ka use kar sakte hai.\n",
        "example": "// immutable object\npublic class ImmutableObjectExample {\n    public static void main(String[] args) {\n        String data = \"Hello, World!\";\n        data = data.replace(\"World\", \"Java\");\n        System.out.println(\"The modified string is: \" + data);\n    }\n}\n\n// sequence\npublic class SequenceExample {\n    public static void main(String[] args) {\n        String data = \"Hello, World!\";\n        System.out.println(\"The first character of the string is: \" + data.charAt(0));\n        System.out.println(\"The last character of the string is: \" + data.charAt(data.length() - 1));\n    }\n}\n\n// object\npublic class ObjectExample {\n    public static void main(String[] args) {\n        String data = \"Hello, World!\";\n        System.out.println(\"The length of the string is: \" + data.length());\n        System.out.println(\"The lower case of the string is: \" + data.toLowerCase());\n        System.out.println(\"The upper case of the string is: \" + data.toUpperCase());\n    }\n}",
        "remcont": "游늷~In Immutable Example: Is example me humne replace() method ka use kiya hai jisme kya \"World\" ko \"Java\" me replace kar sakte hai. Lekin yeh hume ek nayi String object bana sakta hai jo hum \"Hello, Java!\" ke roop me store kar sakte hai.\n\n游늷~In Squence Example: Is example me humne charAt() method ka use kiya hai jisme hum characters ko index ke roop me access kar sakte hai.\n\n游늷~In Object Example: Is example me humne length(), toLowerCase() aur toUpperCase() method ka use kiya hai jisme hum string ke length ko access kar sakte hai aur usko Hinglish me ya capital letters me change kar sakte hai.\n\n游린~Note: String ek built-in class hai jo Java ke standard library me hai. Isliye hum String class ke methods ko direct use kar sakte hai.\n\n"
    },
    {
        "id": "11",
        "name": "if else",
        "message": "游린 Java mein if-else, ek control flow statement hai jo humko decision making mein help karta hai. Hum if-else statement ka use karke, program ko ek condition provide kar sakte hai aur agar ye condition true hoti hai to program ek part chalta hai aur agar ye condition false hoti hai to program doosre part chalta hai.\n\n游늷~1. If statement: If statement ek condition check karta hai aur agar ye true hoti hai to program ek part chalta hai.\n\n游늷~2. If-else statement: If-else statement ek condition check karta hai aur agar ye condition true hoti hai to program ek part chalta hai aur agar ye condition false hoti hai to program doosre part chalta hai.\n\n游늷~3. If-else if ladder: If-else if ladder ek condition check karta hai aur agar ye condition true hoti hai to program ek part chalta hai aur agar ye condition false hoti hai to program doosre condition check karta hai. Isse hum multiple conditions check kar sakte hai.\n",
        "example": "class Main {\n public static void main(String[] args) {\n int number = 10;\n// if Condition\n if (number > 10) {\n System.out.println(\"The number is greater than 10\");\n } else if (number > 5) {      // else if Condition\n System.out.println(\"The number is greater than 5\");\n } else {      // else Condition\n System.out.println(\"The number is less than or equal to 5\");\n }\n }\n}",
        "remcont": "游린~Note: If-else statement ek very useful tool hai jisme hum decision making ka maddad kar sakte hai. Isse hum program ko ek condition ke anuroop modify kar sakte hai.\n\n"
    },
    {
        "id": "12",
        "name": "while Loop",
        "message": "游린 Java mein while loop, ek control flow statement hai jisme hum program ko ek condition ke anuroop chalane ke liye use kar sakte hai. Hum while loop ka use karke, hum program ko repeat karna aur kontinue karna chahte samay use kar sakte hai.\n\n~While loop: While loop ek condition check karta hai aur agar ye condition true hoti hai to program ek part chalta hai. Isse hum ek loop create kar sakte hai jisme hum program ko repeat kar sakte hai.\n",
        "example": "class Main {\n    public static void main(String[] args) {\n        int counter = 0;\n        while (counter < 10) {\n            System.out.println(\"The counter value is: \" + counter);\n            counter++;\n        }\n    }\n}",
        "remcont": "游린 Is example me humne counter < 10 condition check kara hai aur agar ye true hoti hai to program The counter value is: 0 ka output dikhayega aur counter ko 1 increment karta hai. Isse program The counter value is: 1 ka output dikhayega aur counter ko 2 increment karta hai aur is process ko repeat karte hai. Jab tak counter < 10 condition false nahi hoti hai, program ek bar ek bar repeat hoga."
    },
    {
        "id": "13",
        "name": "do while Loop",
        "message": "游린 Java mein do-while loop, ek control flow statement hai jisme hum program ko ek condition ke anuroop chalane ke liye use kar sakte hai. Hum do-while loop ka use karke, hum ek loop create kar sakte hai jisme hum program ko repeat karna chahte hai aur agar ye condition false hoti hai to program ek bar ek bar execute hoga.\n\n~Do-while loop: Do-while loop ek condition check karta hai aur agar ye condition true hoti hai to program ek part chalta hai. Isse hum ek loop create kar sakte hai jisme hum program ko repeat kar sakte hai aur agar ye condition false hoti hai to program ek bar ek bar execute hoga.\n",
        "example": "class Main {\n    public static void main(String[] args) {\n        int counter = 10;\n        do {\n            System.out.println(\"The counter value is: \" + counter);\n            counter++;\n        } while (counter < 10);\n    }\n}",
        "remcont": "游린 Is example me humne counter < 10 condition check kara hai aur agar ye false hoti hai to program The counter value is: 10 ka output dikhayega aur counter ko 1 increment karta hai. Isse program ek bar execute hoga aur counter ko 11 increment karta hai. Ab agar ye condition false hai to program ek bar ek bar execute hoga aur program end hoga.\n\n"
    },
    {
        "id": "14",
        "name": "for Loop",
        "message": "游린 Java mein for loop ek control flow statement hai jisme hum program ko ek condition ke anuroop chalane ke liye use kar sakte hai. For loop ek initialization, condition aur update expressions ke saath use kiya jata hai. Isme hum ek loop chalane ke liye ek variable ko initialize karenge aur hum us variable ki condition check karenge aur update karte hue us loop ko chalne denge.\n",
        "example": "// Syntax:\n/*\nfor (initialization; condition; increment/decrement) {\n    // Loop Body\n}\n*/\n\nclass ForDemo {\n    public static void main(String[] args){\n         for(int i=1; i<11; i++){\n              System.out.println(\"Count is: \" + i);\n         }\n    }\n}",
        "remcont": "游린 Is example me hum i=1 se initialize kiya hai aur hum i<11 condition check kiya hai aur i++ se update kiya hai. Isse hum Count is: 1 se Count is: 10 tak jab tak hum loop ko repeat karte hai jab tak ye condition true nahi hoti hai.\n\n"
    },
    {
        "id": "15",
        "name": "continue Statement",
        "message": "游린 Continue statement ek control flow statement hai jisme hum Java mein ek loop ko skip karne ke liye use kar sakte hai. Continue statement use karne se hum ek iteration ko skip kar sakte hai aur agle iteration ke liye program loop ki body me jata hai.\n\n游늷 Is loop me hum loop ki body me continue statement ka use karte hai jisme hum i variable ke 5 se 8 tak ki values ko skip karte hai aur agle iteration ke liye program loop ki body me jata hai.\n",
        "example": "class ContinueDemo {\n    public static void main(String[] args){\n         for(int i=1; i<11; i++){\n              if(i>=5 && i<=8){\n                   continue;\n              }\n              System.out.println(\"Count is: \" + i);\n         }\n    }\n}",
        "remcont": "游린 Is example me hum i variable ke 5 se 8 tak ki values ko skip karte hai aur agle iteration ke liye program loop ki body me jata hai. Isse hum Count is: 1 se Count is: 4 tak aur Count is: 9 se Count is: 10 tak jab tak hum loop ko repeat karte hai jab tak ye condition true nahi hoti hai.\n\n"
    },
    {
        "id": "16",
        "name": "break Statement",
        "message": "游린 Break statement ek control flow statement hai jisme hum Java mein ek loop ko end karne ke liye use kar sakte hai. Break statement use karne se hum ek iteration ko end kar sakte hai aur loop ko exit kar sakte hai.\n\n游늷 Is loop me hum loop ki body me break statement ka use karte hai jisme hum i variable ke 5 tak ki values ko print karte hai aur jab i variable 5 tak tak pahunche to hum break statement ka use karke hum loop ko end karte hai.\n",
        "example": "class BreakDemo {\n    public static void main(String[] args){\n         for(int i=1; i<11; i++){\n              if(i==5){\n                   break;\n              }\n              System.out.println(\"Count is: \" + i);\n         }\n    }\n}",
        "remcont": "游린 Is example me hum i variable ke 5 tak ki values ko print karte hai aur jab i variable 5 tak tak pahunche to hum break statement ka use karke hum loop ko end karte hai. Isse hum Count is: 1 se Count is: 4 tak jab tak hum loop ko repeat karte hai jab tak ye condition true nahi hoti hai.\n\n"
    },
    {
        "id": "17",
        "name": "switch Statement",
        "message": "游린 Switch statement ek control flow statement hai jisme hum Java mein ek expression ki value ko check karke, kai cases mein bhej sakte hai. Switch statement me hum ek expression ko check karte hai aur agar us expression ki value ek case ki value se match karti hai to hum us case ki body execute karte hai.\n",
        "example": "class SwitchDemo {\n    public static void main(String[] args){\n         int number = 3;\n         switch(number){\n              case 1:\n                   System.out.println(\"Number is 1\");\n                   break;\n              case 2:\n                   System.out.println(\"Number is 2\");\n                   break;\n              case 3:\n                   System.out.println(\"Number is 3\");\n                   break;\n              default:\n                   System.out.println(\"Number is not 1, 2 or 3\");\n         }\n    }\n}",
        "remcont": "游린 Is example me hum number variable ko switch statement me pass karte hai aur hum us variable ki value 3 hai. Isse hum case 3 ki body execute karte hai aur hum Number is 3 print karte hai.\n\n"
    },
    {
        "id": "18",
        "name": "Exception Handling",
        "message": "游린 Exception Handling ek Java mein bahut important concept hai. Isme hum kuch samasyayein solve kar sakte hai jo program chalane ke dauran ho sakte hain. Exception ek special type ke errors hai jo Java ke run-time me hota hai. Agar hum exception ko handle nahi karte to program exit ho jayega.\n\nException Handling me hum 'try', 'catch', 'finally', 'throw', 'throws' ke chand keywords ka use karte hai.\n\n游늷~1. Try Block: Is block me hum code ko write karte hai jisme exception ho sakta hai.\n\n游늷~2. Catch Block: Is block me hum exception ko handle karte hai.\n\n游늷~3. Finally Block: Is block me hum code ko write karte hai jisme exception ho ya na ho, is block ka code execute hona zaroori hai.\n\n游늷~4. Throw Keyword: Is keyword se hum apne own exception throw kar sakte hai.\n\n游늷~5. Throws Keyword: Is keyword se hum apne own method me exception declare kar sakte hai.\n",
        "example": "class ExceptionHandlingDemo {\n    static void divide(int a, int b) {\n        try {\n            if (b == 0) {\n                throw new ArithmeticException(\"Cannot divide by zero\");\n            }\n            System.out.println(a / b);\n        } catch (ArithmeticException e) {\n            System.out.println(e.getMessage());\n        }\n    }\n\n    public static void main(String[] args) {\n        divide(10, 0);\n    }\n}",
        "remcont": "游린 Is example me hum divide method me try block ka use karte hai aur hum b==0 condition check karte hai. Agar ye condition true hoti hai to hum throw keyword ka use karke ek exception generate karte hai. Isse hum catch block me ArithmeticException catch karte hai aur hum getMessage() method ka use karke exception ka message print karte hai.\n\n~Note: Hum ek try block me multiple catch blocks bhi define kar sakte hai. Agar hum ek exception ko multiple catch blocks me catch kar sakte hai to hum ExceptionType ko specific hone se bhi sakta hai.\n\n游린 Exception Handling ek very useful tool hai jisme hum program ko ek condition ke anuroop modify kar sakte hai. Isse hum program ko ek condition ke anuroop modify kar sakte hai aur hum program ko ek condition ke anuroop handle kar sakte hai.\n\n"
    },
    {
        "id": "19",
        "name": "try catch",
        "message": "游린 Try-catch ek exception handling mechanism hai jisme hum Java mein ek block me code chalayenge jisme exception ho sakta hai aur agar exception ho jaaye to hum us exception ko handle karne ke liye catch block ka use kar sakte hai.\n",
        "example": "class TryCatchExample {\n    public static void main(String[] args) {\n        try {\n            int a = 10;\n            int b = 0;\n            int c = a / b;\n            System.out.println(c);\n        } catch (ArithmeticException e) {\n            System.out.println(e.getMessage());\n        }\n    }\n}",
        "remcont": "游린 Is example me hum try block me a, b aur c variable declare karte hai aur hum a aur b variable ke value ko divide karte hai. Agar b variable ki value 0 hoti hai to hum ArithmeticException generate karte hai aur isse hum catch block me ArithmeticException catch karte hai aur hum getMessage() method ka use karke exception ka message print karte hai.\n\n~Note: Ek try block me multiple catch blocks bhi define kar sakte hai. Agar hum ek exception ko multiple catch blocks me catch kar sakte hai to hum ExceptionType ko specific hone se bhi sakta hai.\n\n游린 Try-catch ek very useful tool hai jisme hum program ko ek condition ke anuroop modify kar sakte hai. Isse hum program ko ek condition ke anuroop handle kar sakte hai aur hum program ko ek condition ke anuroop modify kar sakte hai.\n\n"
    },
    {
        "id": "20",
        "name": "Array",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "21",
        "name": "Array Traversing",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "22",
        "name": "Multidimensional Array",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "23",
        "name": "OOPs Concepts",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "24",
        "name": "Class And Object",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "25",
        "name": "Static Members",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "26",
        "name": "Non-Static Members",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "27",
        "name": "Constructor",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "28",
        "name": "Access Modifiers",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "29",
        "name": "Encapsulation",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "30",
        "name": "Packages",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "31",
        "name": "Inheritance",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "32",
        "name": "Method Overloading",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "33",
        "name": "Method Overriding",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "34",
        "name": "super Keyword",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "35",
        "name": "Polymorphism",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "36",
        "name": "Inner Class",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "37",
        "name": "Abstract Class",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "38",
        "name": "Interface",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "39",
        "name": "final Keyword",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "40",
        "name": "Method Introduction",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "41",
        "name": "Parameterized Method",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "42",
        "name": "User input",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "43",
        "name": "Date and Time",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "44",
        "name": "ArrayList",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "45",
        "name": "LinkedList",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "46",
        "name": "HashMap",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "47",
        "name": "HashSet",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "48",
        "name": "Iterator",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "49",
        "name": "finally block",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "50",
        "name": "throw keyword",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "51",
        "name": "File Handling",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "52",
        "name": "Create / Write File",
        "message": "",
        "example": "",
        "remcont": ""
    },
    {
        "id": "53",
        "name": "Read File",
        "message": "",
        "example": "",
        "remcont": ""
    }
    
]
